import {MDQuest} from "../framework/quest";

const shuffleArray = arr => arr.sort(() => Math.random() - 0.5);
const QUESTION_NUM_NAME = [
  "першу",
  "другу",
  "третю",
  "четверту",
  "п’яту",
  "шосту",
  "сьому"
];
const QUESTIONS = [
    ["Дітей годує, а сама не їсть.", "ложка"],
    ["Сімсот соколят на одній подушці сплять, та все на сонце дивляться.", "соняшник"],
    ["Сидить баба на грядках, вся в жупанах і хустках.", "капуста"],
    ["Що дістане зубами потилиці?", "гребінець"],
    ["У воді водиться, хвостатим родиться, коли виростає, хвіст пропадає.", "жаба"],
    ["Із землі з’явився, в воді народився, у вогні хрестився.", "глечик"],
    ["Що то за діжка на чотирьох ніжках, спереду коле, іззаду замітає.", "корова"],
    ["Їхала пані у срібнім жупані, а на тім жупані латка на латці.", "риба"],
    ["Що то за дорога, що півроку із конем їздять, а півроку без коня?", "річка"],
    ["Їсть — не наїдається, а води поп’є — одразу помре.", "вогонь"],
    ["Кружечок сиру на хаті лежить. Собаки виють, дістати не можуть.", "місяць"],
    ["У казанок чорним, із казанка — червоним.", "рак"],
    ["Влітку в шубі, взимку в шапці.", "дерево"],
    ["Від хати до хати йде, а в дім не заходить.", "стежка"],
    ["По синьому морю білі гусаки пливуть.", "хмари"],
    ["Скажи-но, від чого качка пливе?", "берег"],
];




export class Ford extends MDQuest {
    startLoc = 'брід0';


    getQuestion = () => {
        let questions = this.get('questions');
        let questionNum = this.get("номер_загадки");

        return questions[questionNum]
    };

    goTo(name, skipCount) {
        if (this[name] === undefined) {
            this.set('answer', name);
            super.goTo('checkAnswer', skipCount)
        } else {
            super.goTo(name, skipCount)
        }
    };

    checkAnswer = () => {
        let answer = this.get('answer');

        this.set(
            "номер_загадки",
            this.get('count_checkAnswer')-1);

        let [, correctAnswer] = this.getQuestion();

        this.set(
            "номер_загадки",
            this.get('count_checkAnswer'));

        let locName = (answer === correctAnswer)? 'вірно': 'невірно';
        let countName = 'count_'+locName;

        this.set(countName, this.get(countName)+1);
        return this[locName](answer);
    };


    брід0 = () => {
        let questions = shuffleArray(shuffleArray(QUESTIONS));

        this.set('questions', questions);
        this.gset("статус_брід", 1);
        this.set("номер_загадки", 0);

        return `
            Ось і брід, про який домовик розказував. А коло броду водяник лежить,
            сохне. Громадний, как віл. Пузо вивалив, очищі витріщив, увесь у мулі
            та водоростях, риб’ячий хвіст по землі стелеться.
    
            — Вітаю, хазяїне вод, — говорить джура.— Чи дозволиш брід перейти?
    
            Вдарив водяник по воді хвостом, аж луна пішла.
    
            — Ходять тут усякі, — каже, — тільки набридають. З чого мені тебе
            пускати? Хочеш пройти — повесели мене! Відгадаєш три загадки — пущу,
            а як ні — як знаеш, так і перебирайся!
    
            — А чого ж не відгадати? Загадуй!
           
            [Далі](#загадка)
        `
    };


    брід1 = () => `
        — Ну що? — говорить водяник. — Готовий відгадувати?
        
        [Готовий](#загадка)
        
        [Не готовий](#road:доріжка_від_водяника)
        
        ${
            this.gget("берегині_загадка")
            ? "[Передати слова берегинь](#ending:let_go)"
            : ""
        }
    `;

    загадка  = () => {
        let [question,] = this.getQuestion();
        this.gset("загадка", question);

        return `
            — Слухай мою ${QUESTION_NUM_NAME[this.get('номер_загадки')]} 
            загадку, — говорить водяник. — "${question}"
            
            Повів джура поглядом довкола. Над головою [дерева](#дерево)
            шумлять, у [річці](#річка) [жаби](#жаба) кумкають, плескають 
            [риби](#риба), он дрібний [рак](#рак) визирнув із води. 
            [Стежина](#стежка) стелеться уздовж [берега](#берег) аж до 
            [села](#село), де-не-де у [вікнах](#вікно) 
            горить [вогонь](#вогонь). 
            
            На [тину](#тин) коло крайньої [хати](#хата)
            сохнуть [ложки](#ложка) та [глечики](#глечик), у [хліву](#хлів)
            [кінь](#кінь) дрімає, домовик розчісує його 
            [гребінцем](#гребінець), [корова](#корова) виглядає з-за
            [дверей](#двері). До [хати](#хата) похилились
            [соняшники](#соняшник), далі на [грядці](#грядка) росте 
            [горох](#горох) та [капуста](#капуста).
            
            А над головою світить [місяць](#місяць), пливуть дрібні 
            [хмаринки](#хмара).
            
            [Подумати](#road:доріжка_від_водяника)
        `
    };


    вірно = (answer) => `
        — Моя відповідь: ${answer}, — говорить джура.
        
        ${ this.switch(['вірно1', 'вірно2', 'вірно3']) }
    `;


    вірно1 = () => `
        — Вірно, — говорить водяник. — Просто вгадав, чи як? Погляньмо,
        чи ще вгадаєш.
        
        [Далі](#загадка)
    `;


    вірно2 = () => `
        Водяник аж очі витріщив.
    
        — Знов вгадав! — каже. — Не такий ти і дурний, як здаєшся... Гаразд,
        іще одну вгадаєш — пущу.
        
        [Далі](#загадка)
    `;


    вірно3 = () => `
        — Ти ба, який розумний, — промовляє водяник. — Гаразд, іди, 
        щоб я тебе не бачив!
        
        [Далі](#ending:puzzle)
    `;


    невірно = (answer) => `
        — Моя відповідь: ${answer}, — промовляє джура.
        
        ${ this.switch(['невірно1', 'невірно2', 'невірно3']) }
    `;


    невірно1 = () => `
        — Ні! — говорить водяник. — Бачиш? Не гідний ти зі мною 
        у розумі тягатися!
        
        — Дядьку водяник, ви так добре загадки загадуєте, — каже юнак. — Може
        ще й іншу знаєте, більш просту?
        
        — Куди вже простіше! Погляньмо, як ти з іншими впораєшся. Але зарубай
        на носі: тричі поступлюся, більше не проси!
        
        [Далі](#загадка)
    `;


    невірно2 = () => `
        — Не вірно!
        
        Водяник ляскає хвостом по воді, що аж луна йде.
        
        — Яку ви, дядьку, загадку хорошу загадали, — говорить 
        парубок. — А чи не загадаєте ще одну?
        
        — Гаразд, — промовляє водяник, — добрий я сьогодні. Але почнеш
        нахабніти — скінчиться моя доброта!
        
        [Далі](#загадка)
    `;


    невірно3 = () => `
        — Знов ні! — каже водяник. — То що, повертатимеш, звідки прийшов?
        Бачиш, що не рівня ти мені?!
        
        — Такі загадки важкі, — промовляє джура. — Може б ви, дядьку, загадали
        таку, що я б уторопав?
        
        — Щось не віриться, — говорить водяник, — що є така загадка. 
        Востаннє поступлюся! Більше не проси.
        
        [Далі](#остання_загадка)
    `;


    остання_загадка = () => `
        — Слухай мою останню загадку: "Хто вранці ходить на чотирьох,
        удень на двох, а ввечері на троьох?"
        
        [Дядько Василь](#дядько_василь)
        
        [Цирковий кінь](#цирковий_кінь)
        
        [Перевертень](#перевертень)
    `;


    дядько_василь = () => `
    `;


    цирковий_кінь = () => `
    `;


    перевертень = () => `
    `;

}
