import {MDQuest} from "../framework/quest";


export class Ford extends MDQuest {
    startLoc = 'брід0';


    брід0 = () => `
        ${ this.gset("статус_брід", 1) }
        Ось і брід, про який домовик розказував. А коло броду водяник лежить,
        сохне. Громадний, как віл. Пузо вивалив, очищі витріщив, увесь у мулі
        та водоростях, риб’ячий хвіст по землі стелеться.

        — Вітаю, хазяїне вод, — говорить джура.— Чи дозволиш брід перейти?

        Вдарив водяник по воді хвостом, аж луна пішла.

        — Ходять тут усякі, — каже, — тільки набридають. З чого мені тебе
        пускати? Хочеш пройти — повесели мене! Відгадаєш три загадки — пущу,
        а як ні — як знаеш, так і перебирайся!

        — А чого ж не відгадати? Загадуй!
    `;
}
