import {MDQuest} from "../framework/quest";

const shuffleArray = arr => arr.sort(() => Math.random() - 0.5);
const QUESTION_NUM_NAME = [
  "першу",
  "другу",
  "третю",
  "четверту",
  "п’яту",
  "шосту",
  "сьому"
];
const QUESTIONS = [
    ["Дітей годує, а сама не їсть", "ложка"],
    ["Сімсот соколят на одній подушці сплять, та все на сонце дивляться", "соняшник"],
    ["Сидить баба на грядках, вся в жупанах і хустках", "капуста"],
    ["Що дістане зубами потилиці?", "гребінець"]
];




export class Ford extends MDQuest {
    startLoc = 'брід0';


    брід0 = () => {
        this.gset("статус_брід", 1);
        this.set("номер_загадки", 0);

        return `
            Ось і брід, про який домовик розказував. А коло броду водяник лежить,
            сохне. Громадний, как віл. Пузо вивалив, очищі витріщив, увесь у мулі
            та водоростях, риб’ячий хвіст по землі стелеться.
    
            — Вітаю, хазяїне вод, — говорить джура.— Чи дозволиш брід перейти?
    
            Вдарив водяник по воді хвостом, аж луна пішла.
    
            — Ходять тут усякі, — каже, — тільки набридають. З чого мені тебе
            пускати? Хочеш пройти — повесели мене! Відгадаєш три загадки — пущу,
            а як ні — як знаеш, так і перебирайся!
    
            — А чого ж не відгадати? Загадуй!
           
            [Готовий](#загадка)
        `
    };


    брід1 = () => `
        — Ну що? — говорить водяник. — Готовий відгадувати?
        
        [Готовий](#загадка)
        
        [Не готовий](#road:доріжка_від_водяника)
        
        ${
            this.gget("берегині_загадка")
            ? "[Передати слова берегинь](#ending:let_go)"
            : ""
        }

    `;
}
