import {MDQuest} from "../framework/quest";

const shuffleArray = arr => arr.sort(() => Math.random() - 0.5);
const QUESTION_NUM_NAME = [
  "першу",
  "другу",
  "третю",
  "четверту",
  "п’яту",
  "шосту",
  "сьому"
];
const QUESTIONS = [
    ["Дітей годує, а сама не їсть.", "ложка"],
    ["Сімсот соколят на одній подушці сплять, та все на сонце дивляться.", "соняшник"],
    ["Сидить баба на грядках, вся в жупанах і хустках.", "капуста"],
    ["Що дістане зубами потилиці?", "гребінець"],
    ["У воді водиться, хвостатим родиться, коли виростає, хвіст пропадає.", "жаба"],
    ["Із землі з’явився, в воді народився, у вогні хрестився.", "глечик"],
    ["Що то за діжка на чотирьох ніжках, спереду коле, іззаду замітає.", "корова"],
    ["Їхала пані у срібнім жупані, а на тім жупані латка на латці.", "риба"],
    ["Що то за дорога, що півроку із конем їздять, а півроку без коня?", "річка"],
    ["Їсть — не наїдається, а води поп’є — одразу помре.", "вогонь"],
    ["Кружечок сиру на хаті лежить. Собаки виють, дістати не можуть.", "місяць"],
    ["У казанок чорним, із казанка — червоним.", "рак"],
    ["Влітку в шубі, взимку в шапці.", "дерево"],
    ["Від хати до хати йде, а в дім не заходить.", "стежка"],
    ["По синьому морю білі гусаки пливуть.", "хмари"],
    ["Скажи-но, від чого качка пливе?", "берег"],
];




export class Ford extends MDQuest {
    startLoc = 'брід0';


    getQuestion = () => {
        let questions = this.get('questions');
        let questionNum = this.get("номер_загадки");

        return questions[questionNum]
    };

    goTo(name, skipCount) {
        if (this[name] === undefined) {
            this.set('answer', name);
            super.goTo('checkAnswer', skipCount)
        } else {
            super.goTo(name, skipCount)
        }
    };

    checkAnswer = () => {
        let answer = this.get('answer');

        this.set(
            "номер_загадки",
            this.get('count_checkAnswer')-1);

        let [, correctAnswer] = this.getQuestion();

        this.set(
            "номер_загадки",
            this.get('count_checkAnswer'));

        let locName = (answer === correctAnswer)? 'вірно': 'невірно';
        let countName = 'count_'+locName;

        this.set(countName, this.get(countName)+1);
        return this[locName](answer);
    };


    брід0 = () => {
        let questions = shuffleArray(shuffleArray(QUESTIONS));

        this.set('questions', questions);
        this.gset("статус_брід", 1);
        this.set("номер_загадки", 0);

        return `
            Ось і брід, про який домовик розказував. А коло броду водяник лежить,
            сохне. Громадний, как віл. Пузо вивалив, очищі витріщив, увесь у мулі
            та водоростях, риб’ячий хвіст по землі стелеться.
    
            — Вітаю, хазяїне вод, — говорить джура.— Чи дозволиш брід перейти?
    
            Вдарив водяник по воді хвостом, аж луна пішла.
    
            — Ходять тут усякі, — каже, — тільки набридають. З чого мені тебе
            пускати? Хочеш пройти — повесели мене! Відгадаєш три загадки — пущу,
            а як ні — як знаеш, так і перебирайся!
    
            — А чого ж не відгадати? Загадуй!
           
            [Далі](#загадка)
        `
    };


    брід1 = () => `
        — Ну що? — говорить водяник. — Готовий відгадувати?
        
        [Готовий](#загадка)
        
        [Не готовий](#road:доріжка_від_водяника)
        
        ${
            this.gget("берегині_загадка")
            ? "[Передати слова берегинь](#ending:let_go)"
            : ""
        }
    `;

    загадка  = () => {
        let [question,] = this.getQuestion();
        this.gset("загадка", question);

        return `
            — Слухай мою ${QUESTION_NUM_NAME[this.get('номер_загадки')]} 
            загадку, — говорить водяник. — "${question}"
            
            Повів джура поглядом довкола. Над головою [дерева](#дерево)
            шумлять, у [річці](#річка) [жаби](#жаба) кумкають, плескають 
            [риби](#риба), он дрібний [рак](#рак) визирнув із води. 
            [Стежина](#стежка) стелеться уздовж [берега](#берег) аж до 
            [села](#село), де-не-де у [вікнах](#вікно) 
            горить [вогонь](#вогонь). 
            
            На [тину](#тин) коло крайньої [хати](#хата)
            сохнуть [ложки](#ложка) та [глечики](#глечик), у [хліву](#хлів)
            [кінь](#кінь) дрімає, домовик розчісує його 
            [гребінцем](#гребінець), [корова](#корова) виглядає з-за
            [дверей](#двері). До [хати](#хата) похилились
            [соняшники](#соняшник), далі на [грядці](#грядка) росте 
            [горох](#горох) та [капуста](#капуста).
            
            А над головою світить [місяць](#місяць), пливуть дрібні 
            [хмаринки](#хмара).
            
            [Йти геть](#road:доріжка_від_водяника)
        `
    };


    вірно = (answer) => `
        — Моя відповідь: ${answer}, — говорить джура.
        
        ${ this.switch(['вірно1', 'вірно2', 'вірно3']) }
    `;


    вірно1 = () => `
        — Вірно, — говорить водяник. — Просто вгадав, чи як? Погляньмо,
        чи ще вгадаєш.
        
        [Далі](#загадка)
    `;


    вірно2 = () => `
        Водяник аж очі витріщив.
    
        — Знов вгадав! — каже. — Не такий ти і дурний, як здаєшся... Гаразд,
        іще одну вгадаєш — пущу.
        
        [Далі](#загадка)
    `;


    вірно3 = () => `
        — Ти ба, який розумний, — промовляє водяник. — Гаразд, іди, 
        щоб я тебе не бачив!
        
        [Далі](#ending:puzzle)
    `;


    невірно = (answer) => `
        — Моя відповідь: ${answer}, — промовляє джура.
        
        ${ this.switch(['невірно1', 'невірно2', 'невірно3']) }
    `;


    невірно1 = () => `
        — Ні! — говорить водяник. — Бачиш? Не гідний ти зі мною 
        у розумі тягатися!
        
        — Дядьку водяник, — каже юнак, — ви так добре загадки загадуєте. Може
        ще й іншу знаєте, більш просту?
        
        Водяник супиться.
        
        — Куди вже простіше! Погляньмо, як ти з іншими впораєшся. Але зарубай
        на носі: тричі поступлюся, більше не проси!
        
        [Далі](#загадка)
    `;


    невірно2 = () => `
        — Не вірно!
        
        Водяник ляскає хвостом по воді, що аж луна йде.
        
        — Яку ви, дядьку, загадку хорошу загадали, — говорить 
        парубок. — А чи не загадаєте ще одну?
        
        — Гаразд, — промовляє водяник, — добрий я сьогодні. Але почнеш
        нахабніти — скінчиться моя доброта!
        
        [Далі](#загадка)
    `;


    невірно3 = () => `
        — Знов ні! — каже водяник. — То що, повертатимеш, звідки прийшов?
        Бачиш, що не рівня ти мені?!
        
        — Такі загадки важкі, — промовляє джура. — Може б ви, дядьку, загадали
        таку, що я б уторопав?
        
        — Щось не віриться, — говорить водяник, — що є така загадка. 
        Востаннє поступлюся! Більше не проси.
        
        [Далі](#остання_загадка)
    `;


    остання_загадка = () => `
        — Слухай мою останню загадку: "Хто вранці ходить на чотирьох,
        удень на двох, а ввечері на троьох?"
        
        [Дядько Василь](#дядько_василь)
        
        [Цирковий кінь](#цирковий_кінь)
        
        [Перевертень](#перевертень)
    `;


    дядько_василь = () => `
        — Запросто! — говорить юнак. — Це дядько Василь. Він як звечора почне
        пиячити, під ранок додому на карачках приповзає.
        
        — А вдень на двох ходить? — промовяє водяник.
        
        — Авжеж на двох. На бровах.
        
        — А що ж увечері?
        
        — Увечері ходить на трьох, — промовляє джура. — Маю на увазі — на трьох
        зметикувати.
            
        — Ні, неправильно, — говорить водяник. — Відповідь на 
        загадку — "людина".

        [Далі](#дядько_василь_людина)
    `;

    дядько_василь_людина = () => `        
        — Звісно, дядько Василь — людина, — говорить джура, — 
        хоч жінка його каже, що таки свиня.
        
        — Та ні, — каже водяник. — Відповідь на загадку: "людина". Будь-яка.
        
        Парубок чухає потилицю.
        
        — Щось ви не те, дядьку, говорите. Я, приміром, теж людина. Але
        достеменно знаю, що вранці ходив на двох.
            
        [Далі](#відгадка_людина)
    `;


    цирковий_кінь = () => `
        Парубок вдоволено посміхається.
    
        — Це легко, — каже. — Відповідь: цирковий кінь. 
        Вранці приводять на ярмарок, на чотирьох. Удень виступає, 
        трюки показує, на задніх ногах ходить. А ввечері пасеться зтриножений.
        З-три-ножений.

        — Знов ні! — говорить водяник. — Правильна відповідь: людина.
        
        — Що ж ви, дядьку, — промовляє парубок — Де ви бачили людей з чотирма
        ногами?
            
        [Далі](#відгадка_людина)
    `;


    перевертень = () => `
        — Цю я знаю! — каже юнак. — Це перевертень. Вранці в тваринній подобі,
        на чотирьох. Удень в людській — на двох.
        
        — А ввечері? — говорить водяник. — На трьох — це як?
        
        Хлопець знизує плечима.
        
        — Хто їх, перевертнів, розбере. Може, перекидався й не до кінця
        перекинувся. А, може, нога в капкан попала, і тепер шкутильгає.
            
        [Далі](#перевертень_людина)
    `;


    перевертень_людина = () => `
        — Ні, не так! — промовляє водяник. — Відповідь на загадку: "людина".
        
        — Це як подивитись, — каже юнак. — Як людина навчилась у звіра
        перекидатись — тоді людина. Але я знавав одного лиса, що навчився
        робитись людиною. Він у небесному місті нюхачем служить.
        
        — Та ні ж, — говорить водяник. — "Людина" — це вся відгадка. Не якась
        людина, а взагалі.
        
        Парубок хитає головою.
        
        — Таке скажете! Я, ось — людина, але на звіра перекинутись не можу.
        Старші не дозволяють.
            
        [Далі](#відгадка_людина)
    `;


    відгадка_людина = () => `
        — Видно, що дурний! — промовляє водяник. — Слухай: вранці — це коли 
        людина ще мала, повзає на чотирьох...
        
        Джура ступає за спину водяника.
        
        — Що ж це виходить, — каже. — Вже у вашій загадці й ранок не ранок,
        і не ходить, а повзає. Моя відповідь була точнішою!
        
        Водяник повертається за парубком.
        
        — І все ж, — говорить він, — Правильна відгадка: "людина".
        
        Парубок пробує ногою воду.
        
        — Вірна — це якщо загадку перекручувати! Ви ще скажіть,
        що "три" — це "два"!
            
        [Далі](#відгадка_людина1)
    `;


    відгадка_людина1 = () => `
        — Не скажу, — промовляє водяник. — З чого це "три" означатиме "два"?..
        
        Джура пробує ступити на камінь, з якого починається брід.
        
        — А от скажіть, — каже, — дядьку: увечері людина на двох ходить, чи на
        трьох?
        
        Водяник скоса поглядає на джуру.
        
        — На трьох, — промовляє. — Ходить на двох ногах, на ціпок спирається...
        
        Парубок стає на камінь обома ногами.
        
        — Ага! Значить, таки на двох ходить! А Ви казали — на трьох.
            
        [Далі](#відгадка_людина2)
    `;


    відгадка_людина2 = () => `
        — То як я можу розгадувати Ваші загадки, — каже джура, — 
        коли в загадці — одне, а у відгадці — інше. Цю загадку треба по-іншому
        казати...
        
        Хлопець прикидає оком на відстань до іншого берега.
        
        — Наприклад, — додає він. - "Хто на початку життя повзає 
        на чотирьох, у зрілому віці ходить на двох, а в старості ходить на
        двох і спирається на ціпок?"
        
        Водяник супить брови.
        
        — Це ж нецікава загадка буде, — промовляє він.
        
        — І я про те! — говорить джура. — Дайте-но, я цікавішу загадаю...
            
        [Далі](#відгадка_людина3)
    `;


    відгадка_людина3 = () => `
        Парубок ступає ще крок до протилежного берега.
    
        — Що це таке, — каже джура, — Зелене, а потім — хрусь — і червоне?
        
        Водяник тре лоба, очі витріщив, дметься.
        
        — Кавун?
        
        — Ні.
        
        — Порічка?
        
        — Ні-ні.
             
        [Далі](#відгадка_людина4)
    `;


    відгадка_людина4 = () => `     
        Джура ще трохи ступає.
        
        — Гаразд, — говорить водяник. - Кажи, що це.
        
        — Ось же вона, відгадка!
       
        Джура нахиляється до води. Підводиться, чухає потилицю, погляд снує
        по воді. Юнак стрибає далі бродом.
        
        — Ні, ось! Хоча... Ось!
            
        [Далі](#відгадка_людина5)
    `;


    відгадка_людина5 = () => `     
        Хлопець підводиться, долоні стискають жабу.
        
        — Ось вона, відгадка — зелена жаба!
        
        Джура розкриває руки, жаба стрибає геть у воду. Водяник проводжає
        її поглядом. Джура ступає далі.
        
        — І справді, зелена! — промовляє водяник. - Стривай!..
            
        [Далі](#відгадка_людина6)
    `;


    відгадка_людина6 = () => `
        — Стривай! — гукає водяник джурі. — А чому червона?!
        
        — Га? — каже юнак.
        
        Він обертається, нога опускається на наступний камінь.
        
        — Кажу, — говорить водяник, - жаба зелена. 
        А чому вона "хрусь — і червона"?!
        
        Юнак стрибає на протилежний берег.
        
        — Бо у млин потрапила. Бувайте здорові, дядьку!
        
        Рушив джура далі, і вже під ранок був на Січі.
        
        КІНЕЦЬ
    `;

}
