import {MDQuest} from "../framework/quest";


export class Forest extends MDQuest {
    startLoc = 'ліс0';

    ліс0 = () => `
        ${ this.gset("статус_ліс", 1) }
        Заходить, значить, джура до лісу.

        Чутно, як лісом ходить невидима сокира, по деревам стукає та
        втомлено зітхає.

        Вітер підіймається, шумить листя, величезна тінь крокує між деревами —
        та така височенна, що дістає до верхівок дерев.
        Це лісовик звірів випасає та господарство оглядає. От дерева пішли
        нижчими, і тінь зменшилась.

        [Назад](#доріжка2)

        [Далі](#ліс1)
    `;


    ліс1 = () => `
        ${ this.gset("статус_ліс", 2) }
        ${ this.gset("статус_нявка", 3) }
        ${
            this.set(
                "чугайстер_прохання",
                `на Січ поспішаю,— говорить джура,— та от нявки не пускають.

                — Де ж ти нявок шнайшов?— промовляє Чугайстер.

                — На галявині, коло річки...

                — Ну так йди жа мною, — говорить Чугайстер. — Прийдеш на
                галявину — не буде твоїх нявок!

                Сказав — і зник, ніби й не було!
            `)
        }

        Джура крокує лісом. Над головою гілки потріскують, між листям шурхотить,
        чутно як щось гулко кричить — чи то лісові звірі бавляться,
        чи то якась агука слідкує з гілок за парубком.

        Щось бліде та худе пробігає повз хлопця. Джура обертається. Величезний
        дідуган з’являється слідом — бородатий, увесь заріс, у міховій шубі —
        дама, що літо.

        — Тут штій! — говорить.

        Парубок не встиг і слово сказати, як дідуган зник за деревами.

        [Далі](#чугайстер)
    `;


    чугайстер = () => `
        Стоїть парубок, чекає, що-то далі буде.

        А дідуган той із хащі виходить. Іде, регоче.

        — Ну, пощаштило тобі, — каже, — що я тут вештавшя. Блуд до тебе
        прив’яжавшя. Якби не я — жгинув би ти в ліші.

        І всміхається беззубим ротом.

        Придивився джура: не в шубі дідуган — голий, все тіло шерстю густою
        заросло. Та й який це дід? Чугайстер!

        — Спасибі, дядьку, — говорить парубок, — що врятували мене.

        — Та що мені твоє шпашибі, — говорить Чугайстер. —
        Нумо краще жатаншюймо!

        А сам у долоні плескає, та круг хлопця пританцьовує.

        [Відмовитись](#чугайстер_відмовитись)

        [Танцювати](#чугайстер_танцювати)
    `;


    чугайстер_танцювати = () => `
        Затіяли вони танок на лісовій галявині. Джура хоч і був парубком
        міцним — ніших на Січ не брали — за Чугайстром ледь поспіває.
        Джура крок ступає, Чугайстер — десять, джура раз повернеться —
        Чугайстер вихором закрутиться, та все в долоні плескає та примовляє:

        — Ошь так, ошь так! Ми й шпівати, й таншювати, й на шопілші можем грати!

        Швидше та швидше танок іде, Чугайстер вже вітром крутиться навкруг
        хлопця. Відчуває вже парубок, що сили полишають. Аж раз —
        зупинився Чугайстер. Джура як стояв — так і гепнувся на землю.

        — Ну, шлавно потанчювали! — говорить Чугайстер. —
        Отблагодарить ли тебя как, за то, што ражвлек меня?

        — Ще хвильку — говорить джура. — Дайте, дядьку, лиш дух перевести.

        [Далі](#чугайстер_танцювати0)
    `;



    чугайстер_танцювати0 = () => `
        — Я ${ this.get("чугайстер_прохання", '') }
        Поднялся джура и побрёл за Чугайстром.

        [Далі](#доріжка3)
    `;


    чугайстер_відмовитись = () => `
        — Некогда мне — ${ this.get("чугайстер_прохання", '') }

        [Далі](#доріжка3)
    `;


    брод0 = () => `
        ${ this.gset("статус_брод", 1) }
        Вот и брод, о котором говорил домовой. А возле брода водяной лежит,
        сохнет. Громадный, как вол. Пузо вывалил, глаза выпучил, весь в тине
        и водорослях, рыбий хвост по земле стелется.

        — Здравствуй, хозяин вод, — говорит джура.— Позволишь ли перейти
        через брод?

        Ударил водяной по воде хвостом, аж эхо пошло.

        — Ходят тут всякие, — говорит, — только раздражают. С чего мне тебя
        пускать? Хочешь пройти — повесели меня! Отгадаешь три загадки — пущу,
        а если нет — как знаешь, так и перебирайся!

        — А что ж не отгадать? Загадывай!
    `;
}
