import {MDQuest} from "../framework/quest";


export class Intro extends MDQuest {
    startLoc = 'вступ';


    вступ = () => `
        — Чого тільки люди не белькочуть, — говорить старий козак. — Як
        почнуть вигадувати — хоч вуха закладай.
        
        Він підносить люльку до рота, його обвітрене лице окутують клуби диму.
             
        — Приміром, розказують, що козаки, мовляв, по пояс голі 
        шаблями махають, а кожен другий якщо не характерник, то із 
        нечистою силою знається. Але ж козаки — рицарі та стрільці, 
        щоправда на шаблю є багацько вправних. А от 
        характерників — добре, як хоч одного знайдеш. Непроста це наука…
        
        [Далі](#вступ0)
    `;


    вступ0 = () => `
        Старий обводить поглядом довкола. Вогнище тихо потріскує, жаринки
        летять угору до нічного неба. Парубки та дівчата сидять коло вогню, іх
        погляди прикуті до обличчя старого козака.
        
        — Отож, — промовляє він, — якщо люди небилиці говорять, то я теж
        розкажу. Значить-ся так…
        
        Слухачі підсуваються ближче. Руді відблиски вогнища грають на одязі, 
        відсвічують у очах.

        
        — Колись молодой джура — а був він молодшим од вас —
        повертався на Луг від сім’ї. Та, варто сказати, був це не простий
        парубок, бо вчився він на характерника.
        
        [Далі](#вступ1)
    `;



    вступ1 = () => `
        До Січі лишалося верст п’ять, коли застала парубка глупа ніч.
        Добре хоч, на шляху попалося село, і джура попросився до 
        крайньої хати — переночувати.
        
        Спить він, і бачить сон: прилітає до двору чорний ворон, та й ходить
        подвір’ям. Раз каркнув — і прислухається. Каркнув удруге — знову
        мовчить, чорними оченятами-намистинами глипає.
        Каркнув утретє — і полетів геть.
        
        Прокидається юнак, а у вухах ще чути, як пташині крила шурхотять.
        Зрозумів, що наставник-характерник лиху звістку прислав.
        Була б доброю, білим голубом би з’явилася звісточка,
        а раз ворон прилетів, треба збиратися і якнайшвидше рушати на Січ.
        
        [Далі](#вступ2)
    `;



    вступ2 = () => `
        Тихо, щоб не розбудити господарів, підводиться з постілі. 
        Мостниця ледь скрипнула під ногами, надворі щось 
        завило — чи то звір прокричав, чи дитина розплакалась. А, може,
        просто вітер гуляє.
        За вікном промайнула тінь Мари, чутно як вона кличе джуру на ім’я.
        
        Без жодного звуку парубок пробирається до дверей. 
        Мара знов подає голос. Хлопець не отзивається — скоро їй набридне, 
        і вона рушить далі — кликати, та підстерігати тих, хто одізветься.
          
        [Далі](#вступ3)
    `;



    вступ3 = () => `
      
        Парубок прочиняє двері, на підлогу падає яскрава смуга 
        місячного світла. На небі видніється повний місяць — 
        сонце усієї нечисті та мерців.
        
        Юнак виходить із хати, чоботи ступають на прим’яту ковилу. 
        Тихо зачиняє двері, очі підіймаються до неба. Місяць у повні… 
        Ох, лиха година!
        
        [Уперед](#yard:двір)
    `;
}
