import {MDQuest} from "../framework/quest";


export class Intro extends MDQuest {
    startLoc = 'вступ';


    вступ = () => `
        — Чого тільки про люди не белькочуть, — говорить старий козак. - Як
        почнуть вигадувати - хоч вуха закладай.
        
        Він підносить люльку до рота, його обвітрене лице окутують клуби диму.
             
        — Приміром, розказують, що козаки, мовляв, по пояс голі 
        шаблями махають, а кожен другий якщо не характерник, то із 
        нечистою силою знається. Але ж козаки — рицарі та стрільці, 
        хоч так - на шаблю є багацько вправних. А от 
        характерників — добе, як хоч одного знайдеш. Непроста це наука...
        
        [Далі](#вступ0)
    `;


    вступ0 = () => `
        Старий обводить поглядом довкола. Вогнище тихо потріскує, жаринки
        летять угору до нічного неба. Парубки та дівчата сидять довкола, іх
        погляди прикуті до обличчя старого козака.
        
        — Отож, - промовляє він, — якщо люди небилиці говорять, то я теж
        розкажу. Значить-ся так...
        
        Слухачі підсуваються ближче. Руді відблиски вогнища грають на одязі, 
        відсвічують у очах.

        
        — Колись молодой джура — а був він молодшим од вас —
        повертався на Січ із Лугу. Та, варто сказати, був це не простий
        парубок, бо вчився він на характерника.
        
        [Далі](#вступ1)
    `;



    вступ1 = () => `
        До Сечи оставалось вёрст пять, когда застала парубка глупая ночь. Благо, на
        пути попался посёлок и джура попросился на ночлег в крайнюю хату.
        
        Вот спит он и видит сон: прилетает во двор чёрный ворон и ходит по двору.
        Каркнул раз — и прислушивается. Каркнул второй — снова молчит, чёрными
        глазками-бусинками по сторонам смотрит. Каркнул третий раз — и улетел.
        
        
        Просыпается юноша, а в ушах ещё хлопанье крыльев звучит. Понял, что его
        наставник-характерник весточку прислал дурную. Была бы добрая, белым
        голубем бы явилась весточка, а раз ворон, то собираться надо и как можно
        скорее идти на Сечь.
        
        [Далі](#вступ2)
    `;



    вступ2 = () => `
        Тихо, чтоб не разбудить хозяев, поднимется с постели. Под ногами чуть
        скрипнула половица, протяжный вой послышался со двора, за окном Мара
        позвала джуру по имени.
        
        Без единого звука парубок подбирается к двери. Снова Мара подаёт голос.
        Парень не отзывается — скоро ей надоест и она дальше пойдёт — звать,
        да подстерегать тех, кто откликнется.
        
        Парубок приоткрывает дверь, на пол ложится яркая полоска лунного света.
         В небе светит полная луна — солнце всей нечисти и мертвецов.
        
        Юноша выходит из хаты, сапоги ступают на примятый ковыль. Парень тихо
         закрывает дверь, взгляд поднимается к небу. Полная луна... Ох, не к добру!
        
        [Вперёд](#yard:двор)
    `;
}
