import React from "react";
import {MDQuest} from "../framework/quest";


export class Title extends MDQuest {
    startLoc = 'main';

    main = () => {
        let resumeLink = "";
        let resumeLoc = this.gget('__resume_loc', null);
        if (resumeLoc !== null) {
            resumeLink = (<div>
                <a href={"#"+resumeLoc}>Продовжити</a>
            </div>)
        }

        return (
            <div className="main-title">
                <div className="author">Олександр Федоров</div>
                <div className="title-name"><b>П’ять верст</b></div>
                <div className="buttons">
                    <div>
                        <a href="#intro:вступ">Почати</a>
                    </div>
                    { resumeLink }
                    <div>
                        <a href="#поради">Поради</a>
                    </div>
                    <div>
                        <a href="#примітки">Примітки (Спойлери!)</a>
                    </div>
                </div>
                <div className="license">
                    <a rel="license" href="http://creativecommons.org/licenses/by-sa/4.0/">
                        <img alt="Ліцензія Creative Commons" src="https://i.creativecommons.org/l/by-sa/4.0/88x31.png" />
                    </a>
                    <br />
                    Цей твір ліцензовано на умовах&nbsp;
                    <a rel="license" href="http://creativecommons.org/licenses/by-sa/4.0/">
                        Ліцензії Creative Commons Із Зазначенням Авторства — Поширення На Тих Самих Умовах 4.0 Міжнародна
                    </a>.
                </div>
            </div>);
    };



    поради = () => `
        Поради до гри:
        
        1. Ви можете закрити гру будь-якої миті та повернутися до неї пізніше.
           Коли ви повторно відкриєте гру в тому ж браузері, вона почнеться
           з того місця, на якому ви закінчили.
           
        2. Щоб почати заново, або натисніть на "Скинути" угорі сторінки, 
           або перейдіть [на головну](#main) сторінку та натисніть "Почати".
        
        [Назад](#main)
    `;



    примітки = () => `
        **Обережно!** В тексті є спойлери! Якщо ви ще не пройшли гру, далі не
        читайте.
        
        
        Міфічні персонажі оповідання прийшли з енциклопедій,
        із повісті М. Коцюбинського "Тіні забутих предків", а також особистих
        спостережень та узагальнень.
        Однак, заради сюжету довелося трохи збрехати:
        
        1. Жабою, скоріш за все, могла бути відьма, а не бісиця. Але на
        відьму веретено б не подіяло, бо вона не належить до так званих
        "низьких духів".
        
        2. Водяник навряд чи буде загадувати загадки — це більш притаманне
        грайливим духам, таким, як нявка чи лісовик.
        
        3. Проти нечесті допомагає не лише веретено, а й інші знаряддя праці:
        сокира, ніж, батіг. До речі, вони діють і на добрих духів, таких як
        домовик і Чугайстер.
        
        4. Опир = упир. Не плутати з вампірами, вурдалаками і графом
        Дракулою.
        
        5. Домовик не так легко йде на контакт і не настільки балакучий.
        
        [Назад](#main)
    `;
}
